# Pandas Basics

## Pandas 简介
- python 数据分析 library
- 基于 numpy（对ndarray的操作）
- 类似用 python 做 Excel/SQL/R

## Index
- Series
- DataFrame
- Index, reindex and hierarchical indexing
- Merge, Join, Concatenate, Groupby and Aggregate
- Read from csv
- bikes routes counts
- [Cookbook](https://pandas.pydata.org/pandas-docs/stable/user_guide/cookbook.html)

## Series

### 构造和初始化

In [1]:
import pandas as pd
import numpy as np
pd.set_option("max_columns", 50)

In [2]:
# Series 是一个一维数据结构
# pandas 会默认用0到n来作为Series的index
s = pd.Series([1, 3, 'Beijing', 3.14, -123, 'Year!'])
s

0          1
1          3
2    Beijing
3       3.14
4       -123
5      Year!
dtype: object

In [3]:
# 也可以自己指定index
s = pd.Series([1, 3, 'Beijing', 3.14, -123, 'Year!'], index=['A', 'B', 'C', 'D', 'E','G'])
s

A          1
B          3
C    Beijing
D       3.14
E       -123
G      Year!
dtype: object

In [4]:
# 或者直接使用 dictionary 构造 Series, 因为 Series 本身就是 keyvalue pairs
cities = {'Beijing': 55000, 'Shanghai': 60000, 'Shenzhen': 50000, 'Hangzhou': 20000, 'Guangzhou': 25000, 'Suzhou': None}
apts = pd.Series(cities)
apts

Beijing      55000.0
Shanghai     60000.0
Shenzhen     50000.0
Hangzhou     20000.0
Guangzhou    25000.0
Suzhou           NaN
dtype: float64

### 选择数据

In [5]:
# 通过 index 选择数据
apts['Hangzhou']

20000.0

In [6]:
apts[['Hangzhou','Beijing','Shenzhen']]

Hangzhou    20000.0
Beijing     55000.0
Shenzhen    50000.0
dtype: float64

In [7]:
# boolean indexing
apts[apts < 50000]

Hangzhou     20000.0
Guangzhou    25000.0
dtype: float64

In [8]:
# boolean indexing 的工作方式
less_than_50000 = apts < 50000
print(less_than_50000)
print()
print(apts[less_than_50000])

Beijing      False
Shanghai     False
Shenzhen     False
Hangzhou      True
Guangzhou     True
Suzhou       False
dtype: bool

Hangzhou     20000.0
Guangzhou    25000.0
dtype: float64

### 元素赋值

In [9]:
print("Old value: ", apts['Shenzhen'])
apts['Shenzhen'] = 55000
print("New value: ", apts['Shenzhen'])

Old value:  50000.0
New value:  55000.0

In [10]:
print(apts[apts < 50000])
print()
apts[apts <= 50000] = 40000
print(apts[apts < 50000])

Hangzhou     20000.0
Guangzhou    25000.0
dtype: float64

Hangzhou     40000.0
Guangzhou    40000.0
dtype: float64

### 数学运算

In [11]:
# + - * /
apts / 2

Beijing      27500.0
Shanghai     30000.0
Shenzhen     27500.0
Hangzhou     20000.0
Guangzhou    20000.0
Suzhou           NaN
dtype: float64

In [12]:
# 平方
np.square(apts)

Beijing      3.025000e+09
Shanghai     3.600000e+09
Shenzhen     3.025000e+09
Hangzhou     1.600000e+09
Guangzhou    1.600000e+09
Suzhou                NaN
dtype: float64

In [13]:
cars = pd.Series({'Beijing': 300000, 'Shanghai': 400000, 'Shenzhen': 300000, \
                      'Tianjin': 200000, 'Guangzhou': 200000, 'Chongqing': 150000})
cars

Beijing      300000
Shanghai     400000
Shenzhen     300000
Tianjin      200000
Guangzhou    200000
Chongqing    150000
dtype: int64

In [14]:
# 按 index 运算
cars + apts * 100

Beijing      5800000.0
Chongqing          NaN
Guangzhou    4200000.0
Hangzhou           NaN
Shanghai     6400000.0
Shenzhen     5800000.0
Suzhou             NaN
Tianjin            NaN
dtype: float64

### 数据缺失

In [15]:
print('Hangzhou' in apts)
print('Hangzhou' in cars)

True
False

In [16]:
apts.notnull()

Beijing       True
Shanghai      True
Shenzhen      True
Hangzhou      True
Guangzhou     True
Suzhou       False
dtype: bool

In [17]:
print(apts.isnull())
print()
print(apts[apts.isnull()])

Beijing      False
Shanghai     False
Shenzhen     False
Hangzhou     False
Guangzhou    False
Suzhou        True
dtype: bool

Suzhou   NaN
dtype: float64

## Dataframe

    一个 Dataframe 就是一张表格，Series 表示的是一维数组，Dataframe则是一个二维数组，可以类比成一张excel的表格。也可以把Dataframe当做一个一组Series的集合。

### 构造和选择数据

In [67]:
# dataframe可以由一个dictionary构造得到。
data = {'city': ['Beijing', 'Shanghai', 'Guangzhou', 'Shenzhen', 'Hangzhou', 'Chongqing'],
       'year': [2016,2017,2016,2017,2016, 2016],
       'population': [2100, 2300, 1000, 700, 500, 500]}
d1 = pd.DataFrame(data)
print(d1)

        city  year  population
0    Beijing  2016        2100
1   Shanghai  2017        2300
2  Guangzhou  2016        1000
3   Shenzhen  2017         700
4   Hangzhou  2016         500
5  Chongqing  2016         500

In [19]:
for row in zip(d1['city'], d1['year'], d1['population']):
    print(row)
print(d1.columns)
print()
d1

('Beijing', 2016, 2100)
('Shanghai', 2017, 2300)
('Guangzhou', 2016, 1000)
('Shenzhen', 2017, 700)
('Hangzhou', 2016, 500)
('Chongqing', 2016, 500)
Index(['city', 'year', 'population'], dtype='object')

        city  year  population
0    Beijing  2016        2100
1   Shanghai  2017        2300
2  Guangzhou  2016        1000
3   Shenzhen  2017         700
4   Hangzhou  2016         500
5  Chongqing  2016         500

In [20]:
for row in d1.values:
    print(row)

['Beijing' 2016 2100]
['Shanghai' 2017 2300]
['Guangzhou' 2016 1000]
['Shenzhen' 2017 700]
['Hangzhou' 2016 500]
['Chongqing' 2016 500]

In [21]:
print(pd.DataFrame(data))
print()
print(pd.DataFrame(data, columns=['year', 'city', 'population']))

        city  year  population
0    Beijing  2016        2100
1   Shanghai  2017        2300
2  Guangzhou  2016        1000
3   Shenzhen  2017         700
4   Hangzhou  2016         500
5  Chongqing  2016         500

   year       city  population
0  2016    Beijing        2100
1  2017   Shanghai        2300
2  2016  Guangzhou        1000
3  2017   Shenzhen         700
4  2016   Hangzhou         500
5  2016  Chongqing         500

### des 逐行加密

In [68]:
import base64
from pyDes import *
from io import BytesIO
import gzip


key = b'mykingde'
iv = b'\x12\x34\x56\x78\x90\xAB\xCD\xEF'
d = des(key, CBC, iv, pad=None, padmode=PAD_PKCS5)


# input: str
# output: base64bytes
def encrypt(data):
    try:
        return d.encrypt(data.encode('utf8'))
    except:
        return data


# input: base64bytes
# output: utf8bytes
def decrypt(data):
    try:
        return d.decrypt(data)
    except:
        return data


# input: base64bytes
# output: base64str
def compress(content):
    try:
        with BytesIO() as buf:
            with gzip.GzipFile(mode='wb', compresslevel=9, fileobj=buf) as zobj:
                zobj.write(content)
            return base64.b64encode(buf.getvalue())
    except:
        return content


# input: base64str
# output: base64bytes
def decompress(content):
    try:
        b64data = base64.b64decode(content)
        with BytesIO(b64data) as streamdata:
            with gzip.GzipFile(fileobj=streamdata) as z:
                return z.read()
    except:
        return content


# input: str
# output: base64str
def encryptcompress(data):
    return compress(encrypt(data))


# input: base64str
# output: str
def decompressdecrypt(content):
    return decrypt(decompress(content))



frame2 = pd.DataFrame(data, \
                     columns = ['year', 'city', 'population', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
print(frame2)
print()
df = frame2[['city']]
print(df)
dfe = df.applymap(lambda s: encryptcompress(s))
print(pd.concat([df,dfe], axis=1))
dfd = dfe.applymap(lambda s: decompressdecrypt(s))
print(dfd)

       year       city  population debt
one    2016    Beijing        2100  NaN
two    2017   Shanghai        2300  NaN
three  2016  Guangzhou        1000  NaN
four   2017   Shenzhen         700  NaN
five   2016   Hangzhou         500  NaN
six    2016  Chongqing         500  NaN

            city
one      Beijing
two     Shanghai
three  Guangzhou
four    Shenzhen
five    Hangzhou
six    Chongqing
            city                                               city
one      Beijing        b'H4sIAE/HF18C/3t57B7fuuS6DgCJzI50CAAAAA=='
two     Shanghai  b'H4sIAE/HF18C/2t/e9rwUPNM5eIjUSwK8wKmAAD3FjVm...
three  Guangzhou  b'H4sIAE/HF18C/3ub8uPH9a9beA9m8DLOOfL9PQCfzeZx...
four    Shenzhen  b'H4sIAE/HF18C//N421bYobyJoWrx8khmmQARALn7JXMQ...
five    Hangzhou  b'H4sIAE/HF18C/7vkf21r0Iwpgg8kXJM/PnnlCgDKi9Uj...
six    Chongqing  b'H4sIAE/HF18C/3tpIfRWfdm/Ff7G87ZLbnuqAgCMRNYC...
               city
one      b'Beijing'
two     b'Shanghai'
three  b'Guangzhou'
four    b'Shenzhen'
five    b'Hangzhou'
six    b'Chongqing'

In [73]:
print(frame2)
print()
print(frame2['city'])
print()
print(frame2.year)
print()
print(frame2.loc['three']) # loc 取 label based indexing or iloc 取 positional indexing
print()
print(frame2.iloc[2].copy())

       year       city  population debt
one    2016    Beijing        2100  NaN
two    2017   Shanghai        2300  NaN
three  2016  Guangzhou        1000  NaN
four   2017   Shenzhen         700  NaN
five   2016   Hangzhou         500  NaN
six    2016  Chongqing         500  NaN

one        Beijing
two       Shanghai
three    Guangzhou
four      Shenzhen
five      Hangzhou
six      Chongqing
Name: city, dtype: object

one      2016
two      2017
three    2016
four     2017
five     2016
six      2016
Name: year, dtype: int64

year               2016
city          Guangzhou
population         1000
debt                NaN
Name: three, dtype: object

year               2016
city          Guangzhou
population         1000
debt                NaN
Name: three, dtype: object

### 元素赋值

In [24]:
frame2['debt'] = 100
print(frame2)

       year       city  population  debt
one    2016    Beijing        2100   100
two    2017   Shanghai        2300   100
three  2016  Guangzhou        1000   100
four   2017   Shenzhen         700   100
five   2016   Hangzhou         500   100
six    2016  Chongqing         500   100

In [25]:
frame2.debt = np.arange(6)
print(frame2)

       year       city  population  debt
one    2016    Beijing        2100     0
two    2017   Shanghai        2300     1
three  2016  Guangzhou        1000     2
four   2017   Shenzhen         700     3
five   2016   Hangzhou         500     4
six    2016  Chongqing         500     5

In [26]:
# 用Series来指定需要修改的index以及相对应的value，没有指定的默认用NaN.
val = pd.Series([100, 200, 300], index=['two', 'three', 'five'])
frame2['debt'] = val
print(frame2)

       year       city  population   debt
one    2016    Beijing        2100    NaN
two    2017   Shanghai        2300  100.0
three  2016  Guangzhou        1000  200.0
four   2017   Shenzhen         700    NaN
five   2016   Hangzhou         500  300.0
six    2016  Chongqing         500    NaN

In [27]:
frame2['western'] = (frame2.city == 'Chongqing')
print(frame2)

       year       city  population   debt  western
one    2016    Beijing        2100    NaN    False
two    2017   Shanghai        2300  100.0    False
three  2016  Guangzhou        1000  200.0    False
four   2017   Shenzhen         700    NaN    False
five   2016   Hangzhou         500  300.0    False
six    2016  Chongqing         500    NaN     True

In [28]:
frame2.columns

Index(['year', 'city', 'population', 'debt', 'western'], dtype='object')

In [8]:
# 一个DataFrame就和一个numpy 2d array一样，可以被转置
pop = {'Beijing': {2016: 2100, 2017:2200},
      'Shanghai': {2015:2400, 2016:2500, 2017:2600}}
frame3 = pd.DataFrame(pop)
print(frame3)
print()
print(frame3.T)

      Beijing  Shanghai
2016   2100.0      2500
2017   2200.0      2600
2015      NaN      2400

            2016    2017    2015
Beijing   2100.0  2200.0     NaN
Shanghai  2500.0  2600.0  2400.0

In [30]:
# 指定index的顺序
pd.DataFrame(pop, index=[2015,2016,2017])

      Beijing  Shanghai
2015      NaN      2400
2016   2100.0      2500
2017   2200.0      2600

In [31]:
# 以及使用切片初始化数据
pdata = {'Beijing': frame3['Beijing'][:-1],
         'Shanghai':frame3['Shanghai'][:-1]}
pd.DataFrame(pdata)

      Beijing  Shanghai
2016   2100.0      2500
2017   2200.0      2600

In [9]:
# 指定index的名字和列的名字
frame3.index.name = 'year'
frame3.columns.name = 'city'
print(frame3)

city  Beijing  Shanghai
year
2016   2100.0      2500
2017   2200.0      2600
2015      NaN      2400

In [33]:
print(frame2.values)
print()
print(frame2)
print()
print(type(frame2.values))

[[2016 'Beijing' 2100 nan False]
 [2017 'Shanghai' 2300 100.0 False]
 [2016 'Guangzhou' 1000 200.0 False]
 [2017 'Shenzhen' 700 nan False]
 [2016 'Hangzhou' 500 300.0 False]
 [2016 'Chongqing' 500 nan True]]

       year       city  population   debt  western
one    2016    Beijing        2100    NaN    False
two    2017   Shanghai        2300  100.0    False
three  2016  Guangzhou        1000  200.0    False
four   2017   Shenzhen         700    NaN    False
five   2016   Hangzhou         500  300.0    False
six    2016  Chongqing         500    NaN     True

<class 'numpy.ndarray'>

###  index object

In [10]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [11]:
index[1:]

Index(['b', 'c'], dtype='object')

In [36]:
# index 不能被动态改动
# index[1]='d'

In [12]:
index = pd.Index(np.arange(3))
obj2 = pd.Series([2,5,7], index=index)
print(obj2)
print(obj2.index is index)

0    2
1    5
2    7
dtype: int64
True

In [14]:
pop = {'Beijing': {2016: 2100, 2017:2200},
      'Shanghai': {2015:2400, 2016:2500, 2017:2600}}
frame3 = pd.DataFrame(pop)
print('Shanghai' in frame3.columns)
print('2015' in frame3.index)
print(2015 in frame3.index)

True
False
True

In [15]:
2 in obj2.index

True

### index 索引和切片

In [16]:
obj = pd.Series(np.arange(4), index=['a', 'b', 'c', 'd'])
print(obj)
print()
print(obj['b'])

a    0
b    1
c    2
d    3
dtype: int32

1

In [17]:
# 默认的数字 index 也可以使用
print(obj[3])
print()
print(obj[[1,3]])
print()
print(obj[['b','d']])

3

b    1
d    3
dtype: int32

b    1
d    3
dtype: int32

In [18]:
print(obj[obj<2])

a    0
b    1
dtype: int32

In [19]:
print(obj['b':'c'])
obj['b':'c'] = 5
print(obj)

b    1
c    2
dtype: int32
a    0
b    5
c    5
d    3
dtype: int32

In [20]:
# 对 DataFrame 进行 Indexing 与 Series基本相同
a = np.arange(9).reshape(3,3)
print(a)
frame = pd.DataFrame(a, 
                    index = ['a', 'c', 'd'],
                    columns = ['Hangzhou', 'Shenzhen', 'Nanjing'])
frame

[[0 1 2]
 [3 4 5]
 [6 7 8]]

   Hangzhou  Shenzhen  Nanjing
a         0         1        2
c         3         4        5
d         6         7        8

In [21]:
frame['Hangzhou']

a    0
c    3
d    6
Name: Hangzhou, dtype: int32

In [22]:
frame[['Shenzhen', 'Nanjing']]

   Shenzhen  Nanjing
a         1        2
c         4        5
d         7        8

In [23]:
frame[:2]

   Hangzhou  Shenzhen  Nanjing
a         0         1        2
c         3         4        5

In [24]:
frame.loc['a']

Hangzhou    0
Shenzhen    1
Nanjing     2
Name: a, dtype: int32

In [25]:
frame.loc[['a','d'], ['Shenzhen', 'Nanjing']]

   Shenzhen  Nanjing
a         1        2
d         7        8

In [26]:
frame.loc[:'c', 'Hangzhou']

a    0
c    3
Name: Hangzhou, dtype: int32

In [51]:
# DataFrame 也可以用 condition selection
frame[frame.Hangzhou > 1]

   Hangzhou  Shenzhen  Nanjing
c         3         4        5
d         6         7        8

In [52]:
frame < 5

   Hangzhou  Shenzhen  Nanjing
a      True      True     True
c      True      True    False
d     False     False    False

In [53]:
frame[frame < 5] = 0
frame

   Hangzhou  Shenzhen  Nanjing
a         0         0        0
c         0         0        5
d         6         7        8

### reindex

In [54]:
# 把一个Series或者DataFrame按照新的index顺序进行重排
obj = pd.Series([4.5, 7.2, -5.3, 3.2], index=['d', 'b', 'a', 'c'])
print(obj)

d    4.5
b    7.2
a   -5.3
c    3.2
dtype: float64

In [55]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.2
d    4.5
e    NaN
dtype: float64

In [56]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.2
d    4.5
e    0.0
dtype: float64

In [27]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [28]:
# forward
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [59]:
# backward
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [29]:
# 也可以用同样的方法对DataFrame进行reindex
frame = pd.DataFrame(np.arange(9).reshape(3,3), 
                    index = ['a', 'c', 'd'],
                    columns = ['Hangzhou', 'Shenzhen', 'Nanjing'])
frame

   Hangzhou  Shenzhen  Nanjing
a         0         1        2
c         3         4        5
d         6         7        8

In [30]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Hangzhou  Shenzhen  Nanjing
a       0.0       1.0      2.0
b       NaN       NaN      NaN
c       3.0       4.0      5.0
d       6.0       7.0      8.0

In [31]:
# 在reindex的同时，我们还可以重新指定columns
frame.reindex(columns = ['Shenzhen', 'Hangzhou', 'Chongqing'])

   Shenzhen  Hangzhou  Chongqing
a         1         0        NaN
c         4         3        NaN
d         7         6        NaN

In [33]:
frame3 = frame.reindex(index = ['a', 'b', 'c', 'd'],
                    method = 'ffill').\
      reindex(columns = ['Shenzhen', 'Hangzhou', 'Chongqing'])
print(frame3)
print(frame3.loc[['a', 'b', 'd', 'c'], 
                ['Shenzhen', 'Hangzhou', 'Chongqing']])

   Shenzhen  Hangzhou  Chongqing
a         1         0        NaN
b         1         0        NaN
c         4         3        NaN
d         7         6        NaN
   Shenzhen  Hangzhou  Chongqing
a         1         0        NaN
b         1         0        NaN
d         7         6        NaN
c         4         3        NaN

In [34]:
# drop删除Series和DataFrame中的index
print(obj3)
obj4 = obj3.drop(2)
print()
print(obj4)

0      blue
2    purple
4    yellow
dtype: object

0      blue
4    yellow
dtype: object

In [35]:
print(obj3.drop([2,4]))

0    blue
dtype: object

In [36]:
print(frame)

   Hangzhou  Shenzhen  Nanjing
a         0         1        2
c         3         4        5
d         6         7        8

In [37]:
print(frame.drop(['a', 'c']))

   Hangzhou  Shenzhen  Nanjing
d         6         7        8

In [38]:
# drop不仅仅可以删除行，还可以删除列
print(frame.drop('Shenzhen', axis=1))

   Hangzhou  Nanjing
a         0        2
c         3        5
d         6        8

In [40]:
print(frame.drop(['Shenzhen', 'Hangzhou'], axis=1))

   Nanjing
a        2
c        5
d        8

### hierarchical index

In [41]:
# Series的hierarchical indexing
data = pd.Series(np.random.randn(10), 
                 index=[['a','a','a','b','b','c','c','c','d','d'], 
                        [1,2,3,1,2,1,2,3,1,2]])
data

a  1   -1.851909
   2   -3.881073
   3   -0.409199
b  1    2.307872
   2   -0.132830
c  1    0.317795
   2   -0.426109
   3   -0.805544
d  1   -0.544306
   2   -0.677231
dtype: float64

In [42]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2),
            ('c', 3),
            ('d', 1),
            ('d', 2)],
           )

In [43]:
data.b

1    2.307872
2   -0.132830
dtype: float64

In [44]:
data['b':'c']

b  1    2.307872
   2   -0.132830
c  1    0.317795
   2   -0.426109
   3   -0.805544
dtype: float64

In [45]:
data[:2]

a  1   -1.851909
   2   -3.881073
dtype: float64

In [46]:
# unstack和stack可以帮助我们在hierarchical indexing和DataFrame之间进行切换。
data.unstack()

          1         2         3
a -1.851909 -3.881073 -0.409199
b  2.307872 -0.132830       NaN
c  0.317795 -0.426109 -0.805544
d -0.544306 -0.677231       NaN

In [47]:
data.unstack().stack()

a  1   -1.851909
   2   -3.881073
   3   -0.409199
b  1    2.307872
   2   -0.132830
c  1    0.317795
   2   -0.426109
   3   -0.805544
d  1   -0.544306
   2   -0.677231
dtype: float64

In [48]:
type(data.unstack())

pandas.core.frame.DataFrame

In [49]:
# DataFrame的hierarchical indexing
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index = [['a','a','b','b'], [1,2,1,2]],
                    columns = [['Beijing', 'Beijing', 'Shanghai'], 
                               ['apts', 'cars', 'apts']])
frame

    Beijing      Shanghai
       apts cars     apts
a 1       0    1        2
  2       3    4        5
b 1       6    7        8
  2       9   10       11

In [50]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['city', 'type']
frame

city      Beijing      Shanghai
type         apts cars     apts
key1 key2
a    1          0    1        2
     2          3    4        5
b    1          6    7        8
     2          9   10       11

In [51]:
frame.loc['a', 1]

city      type
Beijing   apts    0
          cars    1
Shanghai  apts    2
Name: (a, 1), dtype: int32

In [52]:
frame.loc['a', 2]['Beijing']

type
apts    3
cars    4
Name: (a, 2), dtype: int32

In [53]:
frame.loc['a', 2]['Beijing']['apts']

3

### Concatenate 和 Append

In [54]:
df1 = pd.DataFrame({'apts': [55000, 60000],
                   'cars': [200000, 300000],},
                  index = ['Shanghai', 'Beijing'])
print(df1)

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000

In [55]:
df2 = pd.DataFrame({'apts': [25000, 20000],
                   'cars': [150000, 120000],},
                  index = ['Hangzhou', 'Najing'])
print(df2)

           apts    cars
Hangzhou  25000  150000
Najing    20000  120000

In [56]:
df3 = pd.DataFrame({'apts': [30000, 10000],
                   'cars': [180000, 100000],},
                  index = ['Guangzhou', 'Chongqing'])
print(df3)

            apts    cars
Guangzhou  30000  180000
Chongqing  10000  100000

In [57]:
frames = [df1, df2, df3]
result = pd.concat(frames)
print(result)

            apts    cars
Shanghai   55000  200000
Beijing    60000  300000
Hangzhou   25000  150000
Najing     20000  120000
Guangzhou  30000  180000
Chongqing  10000  100000

In [58]:
# concatenate的时候可以指定keys，这样可以给每一个部分加上一个Key
# 相当于构造了一个 hierarchical index
result2 = pd.concat(frames, keys=['x', 'y', 'z'])
print(result2)

              apts    cars
x Shanghai   55000  200000
  Beijing    60000  300000
y Hangzhou   25000  150000
  Najing     20000  120000
z Guangzhou  30000  180000
  Chongqing  10000  100000

In [59]:
result2.loc['y']

           apts    cars
Hangzhou  25000  150000
Najing    20000  120000

In [60]:
df4 = pd.DataFrame({'salaries': [10000, 30000, 30000, 20000, 15000]},
                  index = ['Suzhou', 'Beijing', 'Shanghai', 'Guangzhou', 'Tianjin'])
print(df4)

           salaries
Suzhou        10000
Beijing       30000
Shanghai      30000
Guangzhou     20000
Tianjin       15000

In [61]:
result3 = pd.concat([result, df4], axis=1, sort=True)
print(result3)

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Chongqing  10000.0  100000.0       NaN
Guangzhou  30000.0  180000.0   20000.0
Hangzhou   25000.0  150000.0       NaN
Najing     20000.0  120000.0       NaN
Shanghai   55000.0  200000.0   30000.0
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0

In [91]:
print(result3.stack())

Beijing    apts         60000.0
           cars        300000.0
           salaries     30000.0
Chongqing  apts         10000.0
           cars        100000.0
Guangzhou  apts         30000.0
           cars        180000.0
           salaries     20000.0
Hangzhou   apts         25000.0
           cars        150000.0
Najing     apts         20000.0
           cars        120000.0
Shanghai   apts         55000.0
           cars        200000.0
           salaries     30000.0
Suzhou     salaries     10000.0
Tianjin    salaries     15000.0
dtype: float64

In [62]:
print(result)
print()
print(df4)
print()
result3 = pd.concat([result, df4], axis=1, join='inner')
print(result3)

            apts    cars
Shanghai   55000  200000
Beijing    60000  300000
Hangzhou   25000  150000
Najing     20000  120000
Guangzhou  30000  180000
Chongqing  10000  100000

           salaries
Suzhou        10000
Beijing       30000
Shanghai      30000
Guangzhou     20000
Tianjin       15000

            apts    cars  salaries
Shanghai   55000  200000     30000
Beijing    60000  300000     30000
Guangzhou  30000  180000     20000

In [63]:
# 用append来做concatenation
print(df1)
print()
print(df2)
print()
df1.append(df2)

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000

           apts    cars
Hangzhou  25000  150000
Najing    20000  120000

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Hangzhou  25000  150000
Najing    20000  120000

In [94]:
print(df1)
print()
print(df4)
print()
df1.append(df4, sort=True)

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000

           salaries
Suzhou        10000
Beijing       30000
Shanghai      30000
Guangzhou     20000
Tianjin       15000

              apts      cars  salaries
Shanghai   55000.0  200000.0       NaN
Beijing    60000.0  300000.0       NaN
Suzhou         NaN       NaN   10000.0
Beijing        NaN       NaN   30000.0
Shanghai       NaN       NaN   30000.0
Guangzhou      NaN       NaN   20000.0
Tianjin        NaN       NaN   15000.0

In [95]:
# Series和DataFrame还可以被一起concatenate，
# 这时候Series会先被转成DataFrame然后做Join，
# Series本来就是一个只有一维的DataFrame
s1 = pd.Series([60, 50], 
               index=['Shanghai', 'Beijing'], 
               name='meal')
s1

Shanghai    60
Beijing     50
Name: meal, dtype: int64

In [96]:
print(df1)
print()
print(s1)
print()
print(pd.concat([df1, s1], axis=1))

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000

Shanghai    60
Beijing     50
Name: meal, dtype: int64

           apts    cars  meal
Shanghai  55000  200000    60
Beijing   60000  300000    50

In [97]:
# append一个row到DataFrame
#注意这里的name是必须要有的，因为要用作Index
s2 = pd.Series([18000, 12000], 
               index=['apts', 'cars'], 
               name='Xiamen') 
s2

apts    18000
cars    12000
Name: Xiamen, dtype: int64

In [98]:
print(df1.append(s2))

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Xiamen    18000   12000

### Merge

In [99]:
df1 = pd.DataFrame({'apts': [55000, 60000, 58000],
                   'cars': [200000, 300000,250000],
                  'cities': ['Shanghai', 'Beijing','Shenzhen']})
df1

    apts    cars    cities
0  55000  200000  Shanghai
1  60000  300000   Beijing
2  58000  250000  Shenzhen

In [100]:
df4 = pd.DataFrame({'salaries': [10000, 30000, 30000, 20000, 15000],
                  'cities': ['Suzhou', 'Beijing', 'Shanghai', 'Guangzhou', 'Tianjin']})
df4

   salaries     cities
0     10000     Suzhou
1     30000    Beijing
2     30000   Shanghai
3     20000  Guangzhou
4     15000    Tianjin

In [101]:
result = pd.merge(df1, df4, on='cities')
result

    apts    cars    cities  salaries
0  55000  200000  Shanghai     30000
1  60000  300000   Beijing     30000

In [102]:
result = pd.merge(df1, df4, on='cities', how='outer')
result

      apts      cars     cities  salaries
0  55000.0  200000.0   Shanghai   30000.0
1  60000.0  300000.0    Beijing   30000.0
2  58000.0  250000.0   Shenzhen       NaN
3      NaN       NaN     Suzhou   10000.0
4      NaN       NaN  Guangzhou   20000.0
5      NaN       NaN    Tianjin   15000.0

In [103]:
result = pd.merge(df1, df4, on='cities', how='right')
result

      apts      cars     cities  salaries
0  55000.0  200000.0   Shanghai     30000
1  60000.0  300000.0    Beijing     30000
2      NaN       NaN     Suzhou     10000
3      NaN       NaN  Guangzhou     20000
4      NaN       NaN    Tianjin     15000

In [104]:
result = pd.merge(df1, df4, on='cities', how='left')
print(result)

    apts    cars    cities  salaries
0  55000  200000  Shanghai   30000.0
1  60000  300000   Beijing   30000.0
2  58000  250000  Shenzhen       NaN

### Join

In [105]:
df1 = pd.DataFrame({'apts': [55000, 60000, 58000],
                   'cars': [200000, 300000,250000]},
                  index=['Shanghai', 'Beijing','Shenzhen'])
df1

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Shenzhen  58000  250000

In [106]:
df4 = pd.DataFrame({'salaries': [10000, 30000, 30000, 20000, 15000]},
                  index=['Suzhou', 'Beijing', 'Shanghai', 'Guangzhou', 'Tianjin'])
df4

           salaries
Suzhou        10000
Beijing       30000
Shanghai      30000
Guangzhou     20000
Tianjin       15000

In [107]:
df1.join(df4)

           apts    cars  salaries
Shanghai  55000  200000   30000.0
Beijing   60000  300000   30000.0
Shenzhen  58000  250000       NaN

In [108]:
df1.join(df4, how='outer')

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Guangzhou      NaN       NaN   20000.0
Shanghai   55000.0  200000.0   30000.0
Shenzhen   58000.0  250000.0       NaN
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0

In [109]:
pd.merge(df1, df4, 
               left_index=True, 
               right_index=True, 
               how='outer')

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Guangzhou      NaN       NaN   20000.0
Shanghai   55000.0  200000.0   30000.0
Shenzhen   58000.0  250000.0       NaN
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0

### 求一段时间的所有时间区间

In [110]:
from datetime import datetime, timedelta
(datetime.now() - timedelta(days=365)).strftime('%y%m%d')

'190316'

In [111]:
dates = []
time_start = datetime.now().date() - timedelta(days=365)
while time_start <= datetime.now().date():
    dates.append(time_start.strftime('%Y%m%d'))
    time_start += timedelta(days=1)

ds1 = pd.DataFrame({'date_start': dates}, index=[0,]*366)
ds2 = pd.DataFrame({'date_end': dates},  index=[0,]*366)
ds = ds1.join(ds2, how='outer')
ds = ds[ds['date_start'] < ds['date_end']]
ds

   date_start  date_end
0    20190316  20190317
0    20190316  20190318
0    20190316  20190319
0    20190316  20190320
0    20190316  20190321
..        ...       ...
0    20200312  20200314
0    20200312  20200315
0    20200313  20200314
0    20200313  20200315
0    20200314  20200315

[66795 rows x 2 columns]

### Group By

In [64]:
# 举个栗子，假设我们现在有一张公司每个员工的收入流水
salaries = pd.DataFrame({
    'Name': ['July', 'Chu', 'Chu', 'Lin', 'July', 'July', 'Chu', 'July'],
    'Year': [2016,2016,2016,2016,2017,2017,2017,2017],
    'Salary': [10000,2000,4000,5000,18000,25000,3000,4000],
    'Bonus': [3000,1000,1000,1200,4000,2300,500,1000]
})
salaries

   Name  Year  Salary  Bonus
0  July  2016   10000   3000
1   Chu  2016    2000   1000
2   Chu  2016    4000   1000
3   Lin  2016    5000   1200
4  July  2017   18000   4000
5  July  2017   25000   2300
6   Chu  2017    3000    500
7  July  2017    4000   1000

In [113]:
group_by_name = salaries.groupby('Name')

In [114]:
# groupby经常和aggregate一起使用
group_by_name.aggregate(sum)

      Year  Salary  Bonus
Name
Chu   6049    9000   2500
July  8067   57000  10300
Lin   2016    5000   1200

In [115]:
# 或者直接 sum
group_by_name.sum()

      Year  Salary  Bonus
Name
Chu   6049    9000   2500
July  8067   57000  10300
Lin   2016    5000   1200

In [116]:
group_by_name_year = salaries.groupby(['Name', 'Year'])
group_by_name_year.sum()

           Salary  Bonus
Name Year
Chu  2016    6000   2000
     2017    3000    500
July 2016   10000   3000
     2017   47000   7300
Lin  2016    5000   1200

In [117]:
group_by_name_year.size()

Name  Year
Chu   2016    2
      2017    1
July  2016    1
      2017    3
Lin   2016    1
dtype: int64

In [118]:
# describe这个function可以为我们展示各种有用的统计信息
group_by_name_year.describe()

          Salary                                                         \
           count          mean           std      min      25%      50%
Name Year
Chu  2016    2.0   3000.000000   1414.213562   2000.0   2500.0   3000.0
     2017    1.0   3000.000000           NaN   3000.0   3000.0   3000.0
July 2016    1.0  10000.000000           NaN  10000.0  10000.0  10000.0
     2017    3.0  15666.666667  10692.676622   4000.0  11000.0  18000.0
Lin  2016    1.0   5000.000000           NaN   5000.0   5000.0   5000.0

                            Bonus                                           \
               75%      max count         mean         std     min     25%
Name Year
Chu  2016   3500.0   4000.0   2.0  1000.000000     0.00000  1000.0  1000.0
     2017   3000.0   3000.0   1.0   500.000000         NaN   500.0   500.0
July 2016  10000.0  10000.0   1.0  3000.000000         NaN  3000.0  3000.0
     2017  21500.0  25000.0   3.0  2433.333333  1504.43788  1000.0  1650.0
Lin  2016   5000.0   5000.0   1.0  1200.000000         NaN  1200.0  1200.0


              50%     75%     max
Name Year
Chu  2016  1000.0  1000.0  1000.0
     2017   500.0   500.0   500.0
July 2016  3000.0  3000.0  3000.0
     2017  2300.0  3150.0  4000.0
Lin  2016  1200.0  1200.0  1200.0

## READ FROM CSV

In [75]:
pd.set_option('display.max_columns', 60)

    bike.csv记录了Montreal自行车路线的数据，具体有7条路线，数据记录了每条自行车路线每天分别有多少人。

In [76]:
bikes = pd.read_csv('data/bikes.csv', encoding='latin1')
bikes

    Date;Berri 1;Brébeuf (données non disponibles);Côte-Sainte-Catherine;Maisonneuve 1;Maisonneuve 2;du Parc;Pierre-Dupuy;Rachel1;St-Urbain (données non disponibles)
0                     01/01/2012;35;;0;38;51;26;10;16;
1                     02/01/2012;83;;1;68;153;53;6;43;
2                   03/01/2012;135;;2;104;248;89;3;58;
3                  04/01/2012;144;;1;116;318;111;8;61;
4                  05/01/2012;197;;2;124;330;97;13;95;
..                                                 ...
305      01/11/2012;2405;;1208;1701;3082;2076;165;2461
306        02/11/2012;1582;;737;1109;2277;1392;97;1888
307          03/11/2012;844;;380;612;1137;713;105;1302
308          04/11/2012;966;;446;710;1277;692;197;1374
309      05/11/2012;2247;;1170;1705;3221;2143;179;2430

[310 rows x 1 columns]

In [77]:
bikes = pd.read_csv('data/bikes.csv', sep=';', parse_dates=['Date'], encoding='latin1', dayfirst=True, index_col='Date')
bikes

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,NaN,0,38,51,26,10,16,NaN
2012-01-02,83,NaN,1,68,153,53,6,43,NaN
2012-01-03,135,NaN,2,104,248,89,3,58,NaN
2012-01-04,144,NaN,1,116,318,111,8,61,NaN
2012-01-05,197,NaN,2,124,330,97,13,95,NaN
...,...,...,...,...,...,...,...,...,...
2012-11-01,2405,NaN,1208,1701,3082,2076,165,2461,NaN
2012-11-02,1582,NaN,737,1109,2277,1392,97,1888,NaN
2012-11-03,844,NaN,380,612,1137,713,105,1302,NaN
2012-11-04,966,NaN,446,710,1277,692,197,1374,NaN
2012-11-05,2247,NaN,1170,1705,3221,2143,179,2430,NaN

更多关于read_csv的说明请查阅documentation [read_csv](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html)

In [122]:
bikes.head()

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,NaN,0,38,51,26,10,16,NaN
2012-01-02,83,NaN,1,68,153,53,6,43,NaN
2012-01-03,135,NaN,2,104,248,89,3,58,NaN
2012-01-04,144,NaN,1,116,318,111,8,61,NaN
2012-01-05,197,NaN,2,124,330,97,13,95,NaN

In [78]:
# dropna会删除所有带NA的行
bikes.dropna()

Empty DataFrame
Columns: [Berri 1, Brébeuf (données non disponibles), Côte-Sainte-Catherine, Maisonneuve 1, Maisonneuve 2, du Parc, Pierre-Dupuy, Rachel1, St-Urbain (données non disponibles)]
Index: []

In [79]:
bikes.dropna(how='all').head()

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,NaN,0,38,51,26,10,16,NaN
2012-01-02,83,NaN,1,68,153,53,6,43,NaN
2012-01-03,135,NaN,2,104,248,89,3,58,NaN
2012-01-04,144,NaN,1,116,318,111,8,61,NaN
2012-01-05,197,NaN,2,124,330,97,13,95,NaN

In [80]:
bikes.dropna(axis=1, how='all').head()

,Berri 1,Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1
Date,,,,,,,
2012-01-01,35,0,38,51,26,10,16
2012-01-02,83,1,68,153,53,6,43
2012-01-03,135,2,104,248,89,3,58
2012-01-04,144,1,116,318,111,8,61
2012-01-05,197,2,124,330,97,13,95

In [81]:
# 填充缺失的数据
row = bikes.iloc[0].copy()
print(row)
print()
# 平均值
print(row.mean())
print()
print(row.fillna(row.mean()))

Berri 1                                35.0
Brébeuf (données non disponibles)       NaN
Côte-Sainte-Catherine                   0.0
Maisonneuve 1                          38.0
Maisonneuve 2                          51.0
du Parc                                26.0
Pierre-Dupuy                           10.0
Rachel1                                16.0
St-Urbain (données non disponibles)     NaN
Name: 2012-01-01 00:00:00, dtype: float64

25.142857142857142

Berri 1                                35.000000
Brébeuf (données non disponibles)      25.142857
Côte-Sainte-Catherine                   0.000000
Maisonneuve 1                          38.000000
Maisonneuve 2                          51.000000
du Parc                                26.000000
Pierre-Dupuy                           10.000000
Rachel1                                16.000000
St-Urbain (données non disponibles)    25.142857
Name: 2012-01-01 00:00:00, dtype: float64

In [86]:
m = bikes.mean(axis=1)
for i, col in enumerate(bikes):
    bikes.iloc[:, i] = bikes.iloc[:, i].fillna(m)
    print(i, col)
    
bikes.head()

0 Berri 1
1 Brébeuf (données non disponibles)
2 Côte-Sainte-Catherine
3 Maisonneuve 1
4 Maisonneuve 2
5 du Parc
6 Pierre-Dupuy
7 Rachel1
8 St-Urbain (données non disponibles)

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,25.142857,0,38,51,26,10,16,25.142857
2012-01-02,83,58.142857,1,68,153,53,6,43,58.142857
2012-01-03,135,91.285714,2,104,248,89,3,58,91.285714
2012-01-04,144,108.428571,1,116,318,111,8,61,108.428571
2012-01-05,197,122.571429,2,124,330,97,13,95,122.571429

In [88]:
bikes[:5]

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,25.142857,0,38,51,26,10,16,25.142857
2012-01-02,83,58.142857,1,68,153,53,6,43,58.142857
2012-01-03,135,91.285714,2,104,248,89,3,58,91.285714
2012-01-04,144,108.428571,1,116,318,111,8,61,108.428571
2012-01-05,197,122.571429,2,124,330,97,13,95,122.571429

In [129]:
berri_bikes = bikes[['Berri 1']].copy()
berri_bikes.head()

            Berri 1
Date
2012-01-01       35
2012-01-02       83
2012-01-03      135
2012-01-04      144
2012-01-05      197

In [89]:
berri_bikes.index

NameError: name 'berri_bikes' is not defined

In [131]:
berri_bikes.index.day

Int64Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
            ...
            27, 28, 29, 30, 31,  1,  2,  3,  4,  5],
           dtype='int64', name='Date', length=310)

In [132]:
berri_bikes.index.weekday

Int64Index([6, 0, 1, 2, 3, 4, 5, 6, 0, 1,
            ...
            5, 6, 0, 1, 2, 3, 4, 5, 6, 0],
           dtype='int64', name='Date', length=310)

In [133]:
berri_bikes.loc[:, 'weekday'] = berri_bikes.index.weekday
berri_bikes[:5]

            Berri 1  weekday
Date
2012-01-01       35        6
2012-01-02       83        0
2012-01-03      135        1
2012-01-04      144        2
2012-01-05      197        3

In [134]:
# 用 groupyby 把骑车人数按照weekday分类，然后用aggregate算出每个工作日的骑车人数之和
weekday_counts = berri_bikes.groupby('weekday').aggregate(sum)
weekday_counts

         Berri 1
weekday
0         134298
1         135305
2         152972
3         160131
4         141771
5         101578
6          99310

In [135]:
weekday_counts.index = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
weekday_counts

           Berri 1
Monday      134298
Tuesday     135305
Wednesday   152972
Thursday    160131
Friday      141771
Saturday    101578
Sunday       99310

In [90]:
# 把每条路线都加起来，然后算出一天骑自行车出门的人数之和
bikes = pd.read_csv('data/bikes.csv', sep=';', parse_dates=['Date'], encoding='latin1', dayfirst=True, index_col='Date')
bikes.head()

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,NaN,0,38,51,26,10,16,NaN
2012-01-02,83,NaN,1,68,153,53,6,43,NaN
2012-01-03,135,NaN,2,104,248,89,3,58,NaN
2012-01-04,144,NaN,1,116,318,111,8,61,NaN
2012-01-05,197,NaN,2,124,330,97,13,95,NaN

In [91]:
bikes_sum = bikes.sum(axis=1).to_frame()
print(bikes_sum.head())
print()
print(bikes_sum.index)

                0
Date
2012-01-01  176.0
2012-01-02  407.0
2012-01-03  639.0
2012-01-04  759.0
2012-01-05  858.0

DatetimeIndex(['2012-01-01', '2012-01-02', '2012-01-03', '2012-01-04',
               '2012-01-05', '2012-01-06', '2012-01-07', '2012-01-08',
               '2012-01-09', '2012-01-10',
               ...
               '2012-10-27', '2012-10-28', '2012-10-29', '2012-10-30',
               '2012-10-31', '2012-11-01', '2012-11-02', '2012-11-03',
               '2012-11-04', '2012-11-05'],
              dtype='datetime64[ns]', name='Date', length=310, freq=None)

In [138]:
bikes_sum.loc[:, 'weekday'] = bikes_sum.index.weekday
bikes_sum.head()

                0  weekday
Date
2012-01-01  176.0        6
2012-01-02  407.0        0
2012-01-03  639.0        1
2012-01-04  759.0        2
2012-01-05  858.0        3

In [139]:
weekday_counts = bikes_sum.groupby('weekday').aggregate(sum)
weekday_counts.index = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
weekday_counts

                  0
Monday     714963.0
Tuesday    698582.0
Wednesday  789722.0
Thursday   829069.0
Friday     738772.0
Saturday   516701.0
Sunday     518047.0